<?php
require_once("Base.php");
class Parser extends Base
{
	/*
	Поля класса: 
		Активы принимаемые к расчету(массив)
		Пассивы принимаемые к расчету(массив)
		Стоимость чистых активов(массив)
		
		Экономическая рентабельность(массив)
		Налог на прибыль(массив)
		Чистая прибыль(массив)
		Рентабельность собственных средств(массив)
		
		Оценка качества дебиторской задолженности(массив)
		
		Однодневный расход материалов(массив)
		Достаточная потребность в матриальных оборотных средств(массив)
		Достаточный уровень коэфициента текущей ликвидности(массив)
		
		Рентабельность активов(переменная)
		Рентабельность продукции(переменная)
		Рентабельность продаж (переменная)
		Рентабельность собственного капитала (переменная)
		Рентабельность обротного капитала (переменная)
		Рентабельность производственных фондов(переменная)
		Рентабельность инвестиций в предприятие(переменная)
		Рентабельность финансовых вложений в предприятие (переменная)
		
		Коэфициент абслютной ликвидности (массив)
		Коэфициент критической или быстрой ликвидности (массив)
		Коэфициент текущей ликвидности (массив)
		Маневренность собственных обортных активов (массив)
		Коэфициент обеспеченности соб. средствами (массив)
		Коэфициент восстановления полатежеспособности предприятия (массив)
		
		Степень платежеспособности общая (массив)
		Степень платежеспособности по текущим показателям (массив)
	*/
	/*
		Нужен метод который будет парсить все данные с файла exel 
		для занесения всех данных в БД (пока что без расчетов). 
		Основной exel для работы находится в папке Main excel file
	*/
}